vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32MG26_DFP.pdsc
      <subFamily DsubFamily="EFR32MG26B510">
        <!-- *************************  Device 'EFR32MG26B510F3200IL136'  ***************************** -->
        <device Dname="EFR32MG26B510F3200IL136">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B510F3200IL136"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B510F3200IL136.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG26B510F3200IM48'  ***************************** -->
        <device Dname="EFR32MG26B510F3200IM48">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B510F3200IM48"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B510F3200IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG26B510F3200IM68'  ***************************** -->
        <device Dname="EFR32MG26B510F3200IM68">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B510F3200IM68"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B510F3200IM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG26B511">
        <!-- *************************  Device 'EFR32MG26B511F3200IL136'  ***************************** -->
        <device Dname="EFR32MG26B511F3200IL136">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B511F3200IL136"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B511F3200IL136.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG26B511F3200IM48'  ***************************** -->
        <device Dname="EFR32MG26B511F3200IM48">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B511F3200IM48"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B511F3200IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG26B511F3200IM68'  ***************************** -->
        <device Dname="EFR32MG26B511F3200IM68">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B511F3200IM68"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B511F3200IM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG26B520">
        <!-- *************************  Device 'EFR32MG26B520F3200IM48'  ***************************** -->
        <device Dname="EFR32MG26B520F3200IM48">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B520F3200IM48"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B520F3200IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG26B520F3200IM68'  ***************************** -->
        <device Dname="EFR32MG26B520F3200IM68">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B520F3200IM68"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B520F3200IM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG26B521">
        <!-- *************************  Device 'EFR32MG26B521F3200IM48'  ***************************** -->
        <device Dname="EFR32MG26B521F3200IM48">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B521F3200IM48"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B521F3200IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG26B521F3200IM68'  ***************************** -->
        <device Dname="EFR32MG26B521F3200IM68">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B521F3200IM68"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B521F3200IM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

