vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32MG26_DFP.pdsc
      <subFamily DsubFamily="EFR32MG26B610">
        <!-- *************************  Device 'EFR32MG26B610F3200IM48'  ***************************** -->
        <device Dname="EFR32MG26B610F3200IM48">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B610F3200IM48"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B610F3200IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG26B611">
        <!-- *************************  Device 'EFR32MG26B611F2048IM48'  ***************************** -->
        <device Dname="EFR32MG26B611F2048IM48">
          <compile header="Device/SiliconLabs/EFR32MG26/Include/em_device.h"  define="EFR32MG26B611F2048IM48"/>
          <debug      svd="SVD/EFR32MG26/EFR32MG26B611F2048IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32MG26">
      <description>Silicon Labs EFR32MG26 device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32MG26*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2025.6.2" condition="EFR32MG26">
      <description>System Startup for Silicon Labs EFR32MG26 device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/SiliconLabs/EFR32MG26/Include/"/>
        <file category="header"  name="Device/SiliconLabs/EFR32MG26/Include/em_device.h"/>
        <!-- system file -->
        <file category="source"  name="Device/SiliconLabs/EFR32MG26/Source/system_efr32mg26.c" attr="config" version="2025.6.2"/>
      </files>
    </component>
  </components>
</package>
